import labData from './lab.js'
import projectsData from './projects.js'

export default
[
    [
        'landingLeave',
        'هيا إلى المغامرة!',
        'اخرج من منطقة البداية.',
        1
    ],
    [
        'areas',
        'رحّالة',
        'زُر كل المناطق.',
        13,
        true // Unique
    ],
    [
        'projects',
        'مهندس الشبكة',
        'تصفّح كل مشروع في منطقة <strong>المشاريع</strong>.',
        projectsData.length,
        true // Unique
    ],
    [
        'lab',
        'عالِم صغير',
        'تصفّح كل تجربة في منطقة <strong>المختبر</strong>.',
        labData.length,
        true // Unique
    ],
    [
        'cookie',
        'أول لقمة',
        'اقبل كعكة واحدة.',
        1
    ],
    [
        'cookie',
        'خبّاز مبتدئ',
        'اقبل ١٠ كعكات.',
        10
    ],
    [
        'cookie',
        'فرن مشتعل',
        'اقبل ١٠٠ كعكة.',
        100
    ],
    [
        'cookie',
        'ملك الكعك',
        'اقبل ١٠٠٠ كعكة.',
        1000
    ],
    [
        'whisper',
        'رسالة في الرمال',
        'اترك همسة.',
        1
    ],
    [
        'sea',
        'صديق الأسماك',
        'انزل إلى الماء وصادق الأسماك.',
        1
    ],
    [
        'upsideDown',
        'سلحفاة',
        'انقلب رأساً على عقب.',
        1
    ],
    [
        'frontFlip',
        'شقلبة أمامية',
        'اقلب للأمام وهبط على قوائمك الأربع.',
        1
    ],
    [
        'backFlip',
        'شقلبة خلفية',
        'اقلب للخلف وهبط على قوائمك الأربع.',
        1
    ],
    [
        'suspensions',
        'راقص الهيدروليك',
        'استخدم نظام التعليق.',
        4
    ],
    [
        'honk',
        'بيب بيب',
        'أطلق صوت التنبيه.',
        10
    ],
    [
        'explosiveCrates',
        'خبير المتفجرات',
        'فجّر كل الصناديق المتفجرة.',
        20,
        true // Unique
    ],
    [
        'goHigh',
        'عنان السماء',
        'ارتفع ١٥ متراً.',
        15
    ],
    [
        'strike',
        'ضربة كاملة',
        'أسقط كل القوارير بضربة واحدة.',
        1
    ],
    [
        'toiletDown',
        'ممنوع الإزعاج',
        'أسقط الكوخ الصغير.',
        1
    ],
    [
        'circuitFinish',
        'ميدالية المشاركة',
        'أنهِ سباقاً.',
        1
    ],
    [
        'circuitFinishFast',
        'البرق',
        'أنهِ سباقاً في أقل من ٣٠ ثانية.',
        1
    ],
    [
        'circuitLeaderboard',
        'من سبق لحق',
        'ادخل قائمة المتصدرين.',
        1
    ],
    [
        'fullDay',
        'أما عندك شغل؟',
        'اقضِ يوماً كاملاً هنا دون توقف.',
        1
    ],
    [
        'distanceDriven',
        'أول خطوة',
        'اقطع كيلومتراً واحداً.',
        1
    ],
    [
        'distanceDriven',
        'هل وصلنا؟',
        'اقطع ١٠ كيلومترات.',
        10
    ],
    [
        'distanceDriven',
        'رحلة القوافل',
        'اقطع ١٠٠ كيلومتر.',
        100
    ],
    [
        'sacrifice',
        'قربان الفوضى',
        'ضحِّ بنفسك على المذبح.',
        1
    ],
    [
        'cataclysm',
        'شاهد العاصفة',
        'شاهد كارثة.',
        1
    ],
    [
        'weatherSnow',
        'ثلج في الصحراء؟',
        'شاهد الطقس المثلج.',
        1
    ],
    [
        'weatherRain',
        'مطر الخير',
        'شاهد الطقس الماطر.',
        1
    ],
    [
        'lightning',
        'صاعقة!',
        'أصابتك صاعقة.',
        1
    ],
    [
        'waterfall',
        'غريزة اللاعب',
        'ماذا توقعت؟ كنزاً؟',
        1
    ],
    [
        'fan',
        'معجبك الوحيد',
        'استدعِ معجباً.',
        1
    ],
    [
        'reset',
        'رتّب غرفتك',
        'أعد كل شيء كما كان.',
        1
    ],
    [
        'statueDown',
        'ثورة!',
        'أسقط ذلك التمثال.',
        1
    ],
    [
        'konami',
        'فوق فوق تحت تحت…',
        'أنت تعرف البقية.',
        1
    ],
    [
        'debug',
        'ليست علّة بل ميزة',
        'افتح واجهة التصحيح.',
        1
    ],
    [
        'hacker',
        'مخترق',
        'هذا الإنجاز مستحيل.',
        1
    ],
]
